<center>  
        CIS 552 Database Design <br>
        Final Project <br>
        $12-04-2022$
</center>

Group - <br>
1. Ishan Bhargava - 02017165  <br>
2. Phani Abhiram Raju Adidam Mohan Sai Venkata - 02073172

### *Importing the necessary libraries*

In [3]:
import mysql.connector
import pandas as pd
import getpass

### *Code to make a secure connection to the HEALTHCARE database*

In [7]:
try:
    
    db = mysql.connector.connect(
        host="localhost",
        user=input(),
        passwd=getpass.getpass(),
        database="HEALTHCARE",
        auth_plugin='mysql_native_password'
    )
    print("\033[1;32m Connection Established!!")
except:
    print("\u001b[31;1m Connection Denied")
    
cur = db.cursor()

root
········
 Connection Established!!

### Query 1 - We can query the total number of prescriptions, total price of all prescriptions, smallest and largest total and the average total of all prescriptions using PRESCRIPTION and PRESCRIPTION_LINES

In [8]:
query1 = 'SELECT COUNT(PRES.RX_ID) AS "Total Number of Prescriptions", ROUND(SUM(SUB.RX_TOTAL), 2) AS "Total Price", ROUND(AVG(SUB.RX_TOTAL),2) AS "Average Price", MIN(SUB.RX_TOTAL) AS "Min Price", MAX(SUB.RX_TOTAL) AS "Max Price" FROM PRESCRIPTION AS PRES JOIN SUBTOT_TAX_TOT AS SUB ON PRES.RX_ID = SUB.RX_ID;'

In [9]:
cur.execute(query1) # Executing query 1
q1_colnames = [i[0] for i in cur.description] # Gathering the column names for the execute query

q1_rows = []
for line in cur:
    q1_rows.append(list(line)) # Collecting all the rows of query
    
q1 = pd.DataFrame(data = q1_rows, columns = q1_colnames) # Creating a dataframe of the query and displaying the same
display(q1)

,Total Number of Prescriptions,Total Price,Average Price,Min Price,Max Price
0,5,28908.08,5781.62,1338.11,8478.75

### Query 2 - We can query the drugs with lowest price and highest price using DRUGS and PRESCRIPTION_LINES tables

In [10]:
query2 = "SELECT DRUG_NAME AS 'Drugs', RX_LINE_PRICE AS 'Price' FROM PRESCRIPTION_LINES NATURAL JOIN DRUGS WHERE RX_LINE_PRICE IN (SELECT MIN(RX_LINE_PRICE) FROM PRESCRIPTION_LINES) OR RX_LINE_PRICE IN (SELECT MAX(RX_LINE_PRICE) FROM PRESCRIPTION_LINES);"

In [11]:
cur.execute(query2) # Executing query 2
q2_colnames = [i[0] for i in cur.description] # Gathering the column names for the execute query

q2_rows = []
for line in cur:
    q2_rows.append(list(line)) # Collecting all the rows of query
    
q2 = pd.DataFrame(data = q2_rows, columns = q2_colnames) # Creating a dataframe of the query and displaying the same
display(q2)

      Drugs  Price
0  Basaglar  70.00
1  Ventolin   6.99

### Query 3 - We can query the most opted insurance policy from PATIENT table

In [12]:
query3 = 'SELECT POL_NAME AS "Policy", Count(*) as "Number of People enrolled" FROM PATIENT as P NATURAL JOIN INSURANCE as I GROUP BY P.POL_ID ORDER BY COUNT(*) DESC LIMIT 1;'

In [13]:
cur.execute(query3) # Executing query 3
q3_colnames = [i[0] for i in cur.description] # Gathering the column names for the execute query

q3_rows = []
for line in cur:
#     print(list(line))
    q3_rows.append(list(line)) # Collecting all the rows of query
    
q3 = pd.DataFrame(data = q3_rows, columns = q3_colnames) # Creating a dataframe of the query and displaying the same
display(q3)

  Policy  Number of People enrolled
0    POS                          9